In [90]:
import pandas as pd

In [91]:
schools_complete = "Resources/schools_complete.csv"
students_complete = "Resources/students_complete.csv"

In [92]:
student_data_df = pd.read_csv(students_complete)
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [93]:
school_data_df = pd.read_csv(schools_complete)
school_data_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [94]:
school_data_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [95]:
student_data_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [96]:
school_data_df.isnull()

    School ID  school_name   type   size  budget
0       False        False  False  False   False
1       False        False  False  False   False
2       False        False  False  False   False
3       False        False  False  False   False
4       False        False  False  False   False
5       False        False  False  False   False
6       False        False  False  False   False
7       False        False  False  False   False
8       False        False  False  False   False
9       False        False  False  False   False
10      False        False  False  False   False
11      False        False  False  False   False
12      False        False  False  False   False
13      False        False  False  False   False
14      False        False  False  False   False

In [97]:
student_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [98]:
school_data_df.notnull()

    School ID  school_name  type  size  budget
0        True         True  True  True    True
1        True         True  True  True    True
2        True         True  True  True    True
3        True         True  True  True    True
4        True         True  True  True    True
5        True         True  True  True    True
6        True         True  True  True    True
7        True         True  True  True    True
8        True         True  True  True    True
9        True         True  True  True    True
10       True         True  True  True    True
11       True         True  True  True    True
12       True         True  True  True    True
13       True         True  True  True    True
14       True         True  True  True    True

In [99]:
student_data_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [100]:
school_data_df.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [101]:
student_data_df.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
dtype: object

In [102]:
#create list of all unique prefixes and suffixes
prefixes_suffixes = ["Dr. ", "Mr. ", "Mrs. ", "Ms. ", "Miss ", " DDS", " MD", " PhD", " DVM"]
#iterate through prefix/suffix list
for word in prefixes_suffixes:
    #replace all prefixes and suffixes in student name column of dataframe with nothing
    student_data_df["student_name"] = student_data_df["student_name"].str.replace(word, "")
#see first 10 rows of fixed dataframe
student_data_df.head(10)

C:\Users\melis\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:6: FutureWarning: The default value of regex will change from True to False in a future version.

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84
5,5,Bryan Miranda,M,9th,Huang High School,94,94
6,6,Sheena Carter,F,11th,Huang High School,82,80
7,7,Nicole Baker,F,12th,Huang High School,96,69
8,8,Michael Roth,M,10th,Huang High School,95,87
9,9,Matthew Greene,M,10th,Huang High School,96,84

In [103]:
#Requested items from Maria:
#Total number of students
#Total number of schools
#Total budget
#Average math score
#Average reading score
#Percentage of students who passed math
#Percentage of students who passed reading
#Overall passing percentage

#join school and student data sets to a new single data set
school_data_complete_df = pd.merge(student_data_df, school_data_df, on=["school_name", "school_name"])
school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [104]:
#Total Student count
#get total student count for merged dataset to verify correct merge
student_count = school_data_complete_df["Student ID"].count()
student_count

39170

In [105]:
#Total School Count
#get list of unique school names from merged dataset
school_count_2 = school_data_complete_df["school_name"].unique()
school_count = len(school_count_2)
print(len(school_count_2))

15

In [106]:
#Total budget for district
#calculate the total budget for the district using school dataset
total_budget = school_data_df["budget"].sum()
total_budget

24649428

In [107]:
#Average math score
#Calculate average math score across the district
average_math_score = school_data_complete_df["math_score"].mean()
average_math_score

78.98537145774827

In [108]:
#Average reading score
#Calculate average reading score across the district
average_reading_score = school_data_complete_df["reading_score"].mean()
average_reading_score

81.87784018381414

In [109]:
#Percentage of students who passed math with a 70 or higher
#create new dataframe that contains studentss with math scores of 70 or higher
passing_math = school_data_complete_df[school_data_complete_df["math_score"] >= 70]
print(passing_math.head())
#Count students with passing math scores and store to a variable
passing_math_count = passing_math["student_name"].count()
print(passing_math_count)
#Calculate percentage of passing students
passing_math_percentage = passing_math_count / float(student_count)* 100

   Student ID   student_name gender grade        school_name  reading_score  \
0           0   Paul Bradley      M   9th  Huang High School             66
4           4     Bonnie Ray      F   9th  Huang High School             97
5           5  Bryan Miranda      M   9th  Huang High School             94
6           6  Sheena Carter      F  11th  Huang High School             82
8           8   Michael Roth      M  10th  Huang High School             95

   math_score  School ID      type  size   budget
0          79          0  District  2917  1910635
4          84          0  District  2917  1910635
5          94          0  District  2917  1910635
6          80          0  District  2917  1910635
8          87          0  District  2917  1910635
29370

In [110]:
#Percentage of students who passed reading with a 70 or higher
#create new dataframe that contains students with a reading score of 70 or higher
passing_reading = school_data_complete_df[school_data_complete_df["reading_score"] >= 70]
#Count number of students with a passing reading score and store to variable
passing_reading_count = passing_reading["student_name"].count()
print(passing_reading_count)
passing_reading.head()
#Calculate percentage of students with passing reading scores
passing_reading_percentage = passing_reading_count / float(student_count) * 100

33610

In [111]:
#print passing student percentages for math & reading
print(passing_math_percentage)
print(passing_reading_percentage)

74.9808526933878
85.80546336482001

In [112]:
#Overall passing percentage
#create new dataframe that contains students who passed math and reading with a 70 or higher
passing_math_reading = school_data_complete_df[(school_data_complete_df["math_score"] >= 70) & (school_data_complete_df["reading_score"] >= 70)]
#count number of students who passed math and reading and save to a variable
passing_math_reading_count = passing_math_reading["student_name"].count()
#Calculate percentage of students who passed math and reading
passing_mr_percentage = passing_math_reading_count / float(student_count) *100
print(passing_mr_percentage)

65.17232575950983

In [113]:
#Create dataframe for district summary information
district_summary_df = pd.DataFrame(
[{"Total Schools": school_count,
 "Total Students": student_count,
 "Total Budget": total_budget,
 "Average Math Score": average_math_score,
 "Average Reading Score": average_reading_score,
 "% Passing Math": passing_math_percentage,
 "% Passing Reading": passing_reading_percentage,
 "% Overall Passing": passing_mr_percentage}])
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [114]:
district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)

In [115]:
district_summary_df["Total Students"]

0    39,170
Name: Total Students, dtype: object

In [116]:
district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)
district_summary_df["Total Budget"]

0    $24,649,428.00
Name: Total Budget, dtype: object

In [117]:
district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map("{:.1f}".format)
district_summary_df["Average Reading Score"] = district_summary_df["Average Reading Score"].map("{:.1f}".format)
district_summary_df["% Passing Math"] = district_summary_df["% Passing Math"].map("{:.0f}%".format)
district_summary_df["% Passing Reading"] = district_summary_df["% Passing Reading"].map("{:.0f}%".format)
district_summary_df["% Overall Passing"] = district_summary_df["% Overall Passing"].map("{:.0f}%".format)
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75%,86%,65%